# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [26]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [ ]:
cars1 = pd.read_csv('/Users/abardier/PycharmProjects/ML_internship/Module3_Pandas_and_SQL/Pandas/dataframes/cars1.csv')
cars2 = pd.read_csv('../../dataframes/cars2.csv')

print(cars1.head())
print(cars2.head())

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [20]:
cars1 = cars1.dropna(axis=1, how='all')
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [21]:
print(f'cars1: {len(cars1)}, cars2: {len(cars2)}')

cars1: 198, cars2: 200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [25]:
cars = pd.concat([cars1, cars2], axis=0)
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [31]:
owners = np.random.randint(low=15000, high=73001, size=len(cars))
owners

array([48495, 16371, 61060, 67279, 64219, 44615, 34714, 25091, 64971,
       45132, 25701, 43887, 54981, 66503, 36575, 53175, 39216, 56983,
       71448, 19209, 59561, 20952, 15044, 63142, 49350, 41034, 44631,
       66124, 54062, 36026, 23089, 51175, 71790, 21613, 33672, 20949,
       21766, 57655, 55152, 24002, 41433, 18517, 51037, 43516, 42359,
       56940, 50187, 20029, 24319, 20981, 16509, 50315, 65703, 38968,
       39020, 31771, 64238, 71440, 30423, 59553, 52505, 41285, 28167,
       57395, 19551, 39458, 41599, 24440, 34869, 53055, 63334, 23391,
       62984, 49203, 59623, 33943, 58895, 60206, 17409, 33838, 36342,
       69278, 25647, 30987, 15266, 25467, 67459, 68028, 15934, 18274,
       60300, 35092, 40584, 27532, 43440, 16219, 16005, 55257, 17535,
       65389, 39686, 21116, 52834, 38943, 32391, 72846, 42205, 54428,
       51245, 55361, 24838, 18355, 43750, 58289, 66072, 39200, 59317,
       51211, 22001, 39753, 72296, 64816, 29557, 37999, 25773, 18646,
       43124, 22960, 21274, 28128, 43636, 39730, 21146, 67104, 60737,
       17836, 24434, 70224, 36495, 34184, 48051, 15909, 24145, 42408,
       18068, 63825, 53532, 25442, 39750, 23391, 42616, 71945, 20439,
       18938, 66793, 60453, 21913, 63615, 60155, 55126, 39064, 30226,
       45640, 52770, 41319, 50115, 36706, 49155, 20337, 51420, 33486,
       61235, 63987, 60822, 68692, 18674, 22081, 42467, 63781, 17494,
       68764, 62662, 19008, 67872, 33262, 20478, 50175, 39533, 44943,
       53880, 42748, 67123, 21369, 46978, 28902, 68105, 46696, 54378,
       69468, 47288, 72010, 71307, 29556, 30683, 21655, 44940, 43418,
       27380, 43188, 47193, 72237, 48715, 50227, 56785, 24320, 31998,
       41815, 25112, 72098, 21171, 63242, 30471, 24986, 18558, 71444,
       26222, 37216, 68689, 19370, 51267, 39737, 32418, 72916, 55350,
       69656, 25000, 66637, 40941, 26883, 52808, 58388, 32253, 48878,
       55658, 38260, 38120, 53436, 62505, 16672, 41548, 19575, 46648,
       37738, 40475, 22662, 41174, 61442, 18732, 43751, 54997, 58744,
       69056, 28528, 19922, 16919, 55372, 32561, 35244, 46578, 65005,
       17723, 22767, 28023, 44324, 42899, 19215, 33738, 46883, 60122,
       50698, 56009, 62697, 19212, 57089, 52858, 17964, 37444, 28482,
       36292, 45302, 25091, 59008, 71063, 64058, 44308, 29098, 68730,
       25936, 18649, 33219, 36263, 37284, 48069, 64951, 69126, 23245,
       24948, 50234, 69387, 48891, 52799, 69956, 53579, 66388, 27830,
       33418, 47520, 68566, 24182, 53491, 55298, 32603, 60825, 68638,
       19495, 48733, 70033, 63519, 43891, 36542, 63848, 68091, 33286,
       20717, 61568, 42528, 50755, 21216, 15322, 61571, 68385, 26411,
       24467, 36736, 41650, 56584, 43656, 45675, 22291, 22886, 47221,
       16492, 41926, 23134, 51492, 69614, 19532, 49488, 63612, 16677,
       56312, 68416, 50519, 34139, 30516, 70140, 69247, 57751, 37415,
       64264, 56373, 50612, 36029, 44083, 37092, 43795, 70029, 54963,
       60381, 49558, 43847, 37253, 58876, 62087, 71011, 71685, 24667,
       22071, 22500, 62338, 62180, 45898, 67273, 49053, 69590, 57868,
       27438, 68261], dtype=int32)

### Step 8. Add the column owners to cars

In [33]:
cars['owners'] = owners
cars.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,48495
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,16371
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,61060
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,67279
4,17.0,8,302,140,3449,10.5,70,1,ford torino,64219
5,15.0,8,429,198,4341,10.0,70,1,ford galaxie 500,44615
6,14.0,8,454,220,4354,9.0,70,1,chevrolet impala,34714
7,14.0,8,440,215,4312,8.5,70,1,plymouth fury iii,25091
8,14.0,8,455,225,4425,10.0,70,1,pontiac catalina,64971
9,15.0,8,390,190,3850,8.5,70,1,amc ambassador dpl,45132